{
    "name": "Gargamell",
    "class": "Wizard",
    "level": 7,
    "Hit_dice": 6,
    "stats": {
      "strength": 8,
      "dexterity": 14,
      "constitution": 14,
      "intelligence": 18,
      "wisdom": 12,
      "charisma": 10
    },
    "armor_class": 17,
    "initiative": 2,
    "proficiency": 3,
    "vida": {
      "Vida": 44,
      "vida_max": 44
    },
    "inventory": [
      { "item": "holy longsword", "quantity": 1 },
      { "item": "scale mail armor", "quantity": 1 },
      { "item": "healing potion", "quantity": 3 }
    ],
    "spell_slots": {
      "spell_level_1": 4,
      "spell_level_2": 3,
      "spell_level_3": 3,
      "spell_level_4": 1,
      "spell_level_1_max": 4,
      "spell_level_2_max": 3,
      "spell_level_3_max": 3,
      "spell_level_4_max": 1
    },
    "hechizos": [
      {
        "nombre": "Lightning Lure",
        "level": 0,
        "escuela": "evocación",
        "casting_time": "1 acción",
        "range": "Self (15-foot radius)",
        "componentes": ["V"],
        "duración": "instantánea",
        "descripción": "You create a lash of lightning energy that strikes at one creature of your choice that you can see within 15 feet of you. The target must succeed on a Strength saving throw or be pulled up to 10 feet in a straight line toward you and then take 1d8 lightning damage if it is within 5 feet of you. At Higher Levels. This spell's damage increases by 1d8 when you reach 5th level (2d8), 11th level (3d8), and 17th level (4d8).",
        "damage" :{
          "hit": 1,
          "saving_throw": "strength_saving_throw",
          "damage_dice": "2d8",
          "damage_type": "lightning"
        }
      },{
        "nombre": "Ray of Frost",
        "level": 0,
        "escuela": "evocación",
        "casting_time": "1 acción",
        "range": "60 feet",
        "componentes": ["V","S"],
        "duración": "instantánea",
        "descripción": "A frigid beam of blue-white light streaks toward a creature within range. Make a ranged spell attack against the target. On a hit, it takes 1d8 cold damage, and its speed is reduced by 10 feet until the start of your next turn. At Higher Levels. The spell’s damage increases by 1d8 when you reach 5th level (2d8), 11th level (3d8), and 17th level (4d8).",
        "damage" :{
          "hit": 0,
          "damage_dice": "2d8",
          "damage_type": "cold"
        }
      },{
        "nombre": "Shocking Grasp",
        "level": 0,
        "escuela": "evocación",
        "casting_time": "1 acción",
        "range": "Touch",
        "componentes": ["V","S"],
        "duración": "instantánea",
        "descripción": "Lightning springs from your hand to deliver a shock to a creature you try to touch. Make a melee spell attack against the target. You have advantage on the attack roll if the target is wearing armor made of metal. On a hit, the target takes 1d8 lightning damage, and it can’t take reactions until the start of its next turn. At Higher Levels. The spell’s damage increases by 1d8 when you reach 5th level (2d8), 11th level (3d8), and 17th level (4d8).",
        "damage" :{
          "hit": 0,
          "damage_dice": "2d8",
          "damage_type": "lightning"
        }
      },{
        "nombre": "Fire Bolt",
        "level": 0,
        "escuela": "evocación",
        "casting_time": "1 acción",
        "range": "120 feet",
        "componentes": ["V","S"],
        "duración": "instantánea",
        "descripción": "You hurl a mote of fire at a creature or object within range. Make a ranged spell attack against the target. On a hit, the target takes 1d10 fire damage. A flammable object hit by this spell ignites if it isn’t being worn or carried. This spell’s damage increases by 1d10 when you reach 5th level (2d10), 11th level (3d10), and 17th level (4d10).",
        "damage" :{
          "hit": 0,
          "damage_dice": "2d10",
          "damage_type": "fire"
        }
      },{
        "nombre": "Burning Hands",
        "level": 1,
        "escuela": "evocación",
        "casting_time": "1 acción",
        "range": "Self (15-foot cone)",
        "componentes": ["V","S"],
        "duración": "instantánea",
        "descripción": "As you hold your hands with thumbs touching and fingers spread, a thin sheet of flames shoots forth from your outstretched fingertips. Each creature in a 15-foot cone must make a Dexterity saving throw. A creature takes 3d6 fire damage on a failed save, or half as much damage on a successful one. The fire ignites any flammable objects in the area that aren’t being worn or carried. At Higher Levels. When you cast this spell using a spell slot of 2nd level or higher, the damage increases by 1d6 for each slot level above 1st.",
        "damage" :{
          "hit": 1,
          "saving_throw": "dexterity_saving_throw",
          "damage_dice": "3d6",
          "damage_type": "fire",
          "add_damage_x_level": "1d6"
        }
      },{
        "nombre": "Thunderwave",
        "level": 1,
        "escuela": "evocación",
        "casting_time": "1 acción",
        "range": "Self (15-foot cone)",
        "componentes": ["V","S"],
        "duración": "instantánea",
        "descripción": "A wave of thunderous force sweeps out from you. Each creature in a 15-foot cube originating from you must make a Constitution saving throw. On a failed save, a creature takes 2d8 thunder damage and is pushed 10 feet away from you. On a successful save, the creature takes half as much damage and isn’t pushed. In addition, unsecured objects that are completely within the area of effect are automatically pushed 10 feet away from you by the spell’s effect, and the spell emits a thunderous boom audible out to 300 feet. At Higher Levels. When you cast this spell using a spell slot of 2nd level or higher, the damage increases by 1d8 for each slot level above 1st.",
        "damage" :{
          "hit": 1,
          "saving_throw": "dexterity_saving_throw",
          "damage_dice": "3d6",
          "damage_type": "fire",
          "add_damage_x_level": "1d6"
        }
      },{
        "nombre": "Chromatic Orb",
        "level": 1,
        "escuela": "evocación",
        "casting_time": "1 acción",
        "range": "90 feet",
        "componentes": ["V","S","M (a diamond worth at least 50 gp"],
        "duración": "instantánea",
        "descripción": "You hurl a 4-inch-diameter sphere of energy at a creature that you can see within range. You choose acid, cold, fire, lightning, poison, or thunder for the type of orb you create, and then make a ranged spell attack against the target. If the attack hits, the creature takes 3d8 damage of the type you chose. At Higher Levels. When you cast this spell using a spell slot of 2nd level or higher, the damage increases by 1d8 for each slot level above 1st.",
        "damage" :{
          "hit": 0,
          "damage_dice": "3d8",
          "damage_type": ["fire","cold","acid","lightning","poison","thunder"],
          "add_damage_x_level": "1d8"
        }
      },{
        "nombre": "Frost Fingers",
        "level": 1,
        "escuela": "evocación",
        "casting_time": "1 acción",
        "range": "Self (15-foot cone)",
        "componentes": ["V","S"],
        "duración": "instantánea",
        "descripción": "Freezing cold blasts from your fingertips in a 15-foot cone. Each creature in that area must make a Constitution saving throw, taking 2d8 cold damage on a failed save, or half as much damage on a successful one. The cold freezes nonmagical liquids in the area that aren't being worn or carried. At Higher Levels. When you cast this spell using a spell slot of 2nd level or higher, the damage increases by 1d8 for each slot level above 1st.",
        "damage" :{
          "hit": 1,
          "saving_throw": "constitution_saving_throw",
          "damage_dice": "2d8",
          "damage_type": "cold",
          "add_damage_x_level": "1d8"
        }
      },{
        "nombre": "Magic Missile",
        "level": 1,
        "escuela": "evocación",
        "casting_time": "1 acción",
        "range": "120 feet",
        "componentes": ["V","S"],
        "duración": "instantánea",
        "descripción": "You create three glowing darts of magical force. Each dart hits a creature of your choice that you can see within range. A dart deals 1d4 + 1 force damage to its target. The darts all strike simultaneously and you can direct them to hit one creature or several. At Higher Levels. When you cast this spell using a spell slot of 2nd level or higher, the spell creates one more dart for each slot level above 1st.",
        "damage" :{
          "hit": 0,
          "damage_dice": "3x(1d4 + 1)",
          "damage_type": "force",
          "add_damage_x_level": "1d4+1"
        }
      },{
        "nombre": "Witch Bolt",
        "level": 1,
        "escuela": "evocación",
        "casting_time": "1 acción",
        "range": "30 feet",
        "componentes": ["V","S","M (a twig from a tree that has been struck by lightning"],
        "duración": "Concentration, up to 1 minute",
        "descripción": "A beam of crackling, blue energy lances out toward a creature within range, forming a sustained arc of lightning between you and the target. Make a ranged spell attack against that creature. On a hit, the target takes 1d12 lightning damage, and on each of your turns for the duration, you can use your action to deal 1d12 lightning damage to the target automatically. The spell ends if you use your action to do anything else. The spell also ends if the target is ever outside the spell’s range or if it has total cover from you. At Higher Levels. When you cast this spell using a spell slot of 2nd level or higher, the initial damage increases by 1d12 for each slot level above 1st.",
        "damage" :{
          "hit": 0,
          "damage_dice": "1d12",
          "damage_type": "lightning",
          "add_damage_x_level": "1d12"
        }
      },{
        "nombre": "Shield",
        "level": 1,
        "escuela": "abjuration",
        "casting_time": "1 reaction, which you take when you are hit by an attack or targeted by the magic missile spell",
        "range": "Self",
        "componentes": ["V","S"],
        "duración": "1 Round",
        "descripción": "An invisible barrier of magical force appears and protects you. Until the start of your next turn, you have a +5 bonus to AC, including against the triggering attack, and you take no damage from magic missile.",
        "add_to_ac": "5"
      },{
        "nombre": "Alarm",
        "level": 1,
        "escuela": "abjuration",
        "casting_time": "1 minute",
        "range": "30 feet",
        "componentes": ["V","S","M (a tiny bell and a piece of fine silver wire"],
        "duración": "8 hour",
        "descripción": "You set an alarm against unwanted intrusion. Choose a door, a window, or an area within range that is no larger than a 20-foot cube. Until the spell ends, an alarm alerts you whenever a Tiny or larger creature touches or enters the warded area. When you cast the spell, you can designate creatures that won't set off the alarm. You also choose whether the alarm is mental or audible. A mental alarm alerts you with a ping in your mind if you are within 1 mile of the warded area. This ping awakens you if you are sleeping. An audible alarm produces the sound of a hand bell for 10 seconds within 60 feet"
      },{
        "nombre": "Silvery Barbs",
        "level": 1,
        "escuela": "Enchantment",
        "casting_time": "1 reaction of an attack roll, an ability check or a saving throw",
        "range": "60 feet",
        "componentes": "V",
        "duración": "instantánea",
        "descripción": "You magically distract the triggering creature and turn its momentary uncertainty into encouragement for another creature. The triggering creature must reroll the d20 and use the lower roll. You can then choose a different creature you can see within range (you can choose yourself). The chosen creature has advantage on the next attack roll, ability check, or saving throw it makes within 1 minute. A creature can be empowered by only one use of this spell at a time."
      },{
        "nombre": "Aganazzar's Scorcher",
        "level": 2,
        "escuela": "evocación",
        "casting_time": "1 acción",
        "range": "30 feet",
        "componentes": ["V","S","M (a red dragon's scale)"],
        "duración": "instantánea",
        "descripción": "A line of roaring flame 30 feet long and 5 feet wide emanates from you in a direction you choose. Each creature in the line must make a Dexterity saving throw. A creature takes 3d8 fire damage on a failed save, or half as much damage on a successful one. At Higher Levels. When you cast this spell using a spell slot of 3rd level or higher, the damage increases by 1d8 for each slot level above 2nd.",
        "damage" :{
          "hit": 0,
          "damage_dice": "3d8",
          "damage_type": "fire",
          "add_damage_x_level": "1d8"
        }
      },{
        "nombre": "Gust of Wind",
        "level": 2,
        "escuela": "evocación",
        "casting_time": "1 acción",
        "range": "Self (60-foot line)",
        "componentes": ["V","S","M (a legume seed)"],
        "duración": "Concentration, up to 1 minute",
        "descripción": "A line of strong wind 60 feet long and 10 feet wide blasts from you in a direction you choose for the spell’s duration. Each creature that starts its turn in the line must succeed on a Strength saving throw or be pushed 15 feet away from you in a direction following the line. Any creature in the line must spend 2 feet of movement for every 1 foot it moves when moving closer to you. The gust disperses gas or vapor, and it extinguishes candles, torches, and similar unprotected flames in the area. It causes protected flames, such as those of lanterns, to dance wildly and has a 50 percent chance to extinguish them. As a bonus action on each of your turns before the spell ends, you can change the direction in which the line blasts from you."
      },{
        "nombre": "Scorching Ray",
        "level": 2,
        "escuela": "evocación",
        "casting_time": "1 acción",
        "range": "120 feet",
        "componentes": ["V","S"],
        "duración": "instantánea",
        "descripción": "You create three rays of fire and hurl them at targets within range. You can hurl them at one target or several. Make a ranged spell attack for each ray. On a hit, the target takes 2d6 fire damage. At Higher Levels. When you cast this spell using a spell slot of 3rd level or higher, you create one additional ray for each slot level above 2nd.",
        "damage" :{
          "hit": 0,
          "damage_dice": "3x(2d6)",
          "damage_type": "fire",
          "add_damage_x_level": "2d6"
        }
      },{
        "nombre": "Shatter",
        "level": 2,
        "escuela": "evocación",
        "casting_time": "1 acción",
        "range": "60 feet",
        "componentes": ["V","S","M (a chip of mica)"],
        "duración": "instantánea",
        "descripción": "You create three rays of fire and hurl them at targets within range. You can hurl them at one target or several. Make a ranged spell attack for each ray. On a hit, the target takes 2d6 fire damage. At Higher Levels. When you cast this spell using a spell slot of 3rd level or higher, you create one additional ray for each slot level above 2nd.",
        "damage" :{
          "hit": 1,
          "saving_throw": "constitution_saving_throw",
          "damage_dice": "3d8",
          "damage_type": "thunder",
          "add_damage_x_level": "1d6"
        }
      },{
        "nombre": "Alter self",
        "level": 2,
        "escuela": "transmutation",
        "casting_time": "1 acción",
        "range": "Self",
        "componentes": ["V","S"],
        "duración": "Concentration, up to 1 hour",
        "descripción": "You assume a different form. When you cast the spell, choose one of the following options, the effects of which last for the duration of the spell. While the spell lasts, you can end one option as an action to gain the benefits of a different one. Aquatic Adaptation. You adapt your body to an aquatic environment, sprouting gills, and growing webbing between your fingers. You can breathe underwater and gain a swimming speed equal to your walking speed. Change Appearance. You transform your appearance. You decide what you look like, including your height, weight, facial features, sound of your voice, hair length, coloration, and distinguishing characteristics, if any. You can make yourself appear as a member of another race, though none of your statistics change. You also don’t appear as a creature of a different size than you, and your basic shape stays the same; if you're bipedal, you can’t use this spell to become quadrupedal, for instance. At any time for the duration of the spell, you can use your action to change your appearance in this way again. Natural Weapons. You grow claws, fangs, spines, horns, or a different natural weapon of your choice. Your unarmed strikes deal 1d6 bludgeoning, piercing, or slashing damage, as appropriate to the natural weapon you chose, and you are proficient with your unarmed strikes. Finally, the natural weapon is magic and you have a +1 bonus to the attack and damage rolls you make using it."
      },{
        "nombre": "Fireball",
        "level": 3,
        "escuela": "evocation",
        "casting_time": "1 acción",
        "range": "150 feet",
        "componentes": ["V","S","M (a tiny ball of bat guano and sulfur"],
        "duración": "instantánea",
        "descripción": "A bright streak flashes from your pointing finger to a point you choose within range then blossoms with a low roar into an explosion of flame. Each creature in a 20-foot radius must make a Dexterity saving throw. A target takes 8d6 fire damage on a failed save, or half as much damage on a successful one. The fire spreads around corners. It ignites flammable objects in the area that aren’t being worn or carried. At Higher Levels. When you cast this spell using a spell slot of 4th level or higher, the damage increases by 1d6 for each slot level above 3rd.",
        "damage" :{
          "hit": 1,
          "saving_throw": "dexterity_saving_throw",
          "damage_dice": "8d6",
          "damage_type": "fire",
          "add_damage_x_level": "1d6"
        }
      },{
        "nombre": "Counterspell",
        "level": 3,
        "escuela": "abjuration",
        "casting_time": "1 reaction",
        "range": "60 feet",
        "componentes": "S",
        "duración": "instantánea",
        "descripción": "You attempt to interrupt a creature in the process of casting a spell. If the creature is casting a spell of 3rd level or lower, its spell fails and has no effect. If it is casting a spell of 4th level or higher, make an ability check using your spellcasting ability. The DC equals 10 + the spell’s level. On a success, the creature’s spell fails and has no effect. At Higher Levels. When you cast this spell using a spell slot of 4th level or higher, the interrupted spell has no effect if its level is less than or equal to the level of the spell slot you used."
      },{
        "nombre": "Gravity Sinkhole",
        "level": 4,
        "escuela": "evocation",
        "casting_time": "1 action",
        "range": "120 feet",
        "componentes": ["V","S","M (a black marble)"],
        "duración": "instantánea",
        "descripción": "A 20-foot-radius sphere of crushing force forms at a point you can see within range and tugs at the creatures there. Each creature in the sphere must make a Constitution saving throw. On a failed save, the creature takes 5d10 force damage, and is pulled in a straight line toward the center of the sphere, ending in an unoccupied space as close to the center as possible (even if that space is in the air). On a successful save, the creature takes half as much damage and isn't pulled. At Higher Levels. When you cast this spell using a spell slot of 5th level or higher, the damage increases by 1d10 for each slot level above 4th.",
        "damage" :{
          "hit": 1,
          "saving_throw": "constitution_saving_throw",
          "damage_dice": "5d10",
          "damage_type": "force",
          "add_damage_x_level": "1d10"
        }
      },{
        "nombre": "Sickening Radiance",
        "level": 4,
        "escuela": "evocation",
        "casting_time": "1 action",
        "range": "120 feet",
        "componentes": ["V","S"],
        "duración": "Concentration, up to 10 minutes",
        "descripción": "Dim, greenish light spreads within a 30-foot-radius sphere centered on a point you choose within range. The light spreads around corners, and it lasts until the spell ends. When a creature moves into the spell’s area for the first time on a turn or starts its turn there, that creature must succeed on a Constitution saving throw or take 4d10 radiant damage, and it suffers one level of exhaustion and emits a dim, greenish light in a 5-foot radius. This light makes it impossible for the creature to benefit from being invisible. The light and any levels of exhaustion caused by this spell go away when the spell ends.",
        "damage" :{
          "hit": 1,
          "saving_throw": "constitution_saving_throw",
          "damage_dice": "4d10",
          "damage_type": "force",
          "add_damage_x_level": "1d10"
        }
      }
    ]
  }
  

// per importar dades del jason darulo
// import json

// Abre el archivo JSON
// with open('datos.json', 'r') as f:
//   # Carga los datos del archivo JSON
//   datos = json.load(f)

// Ahora puedes trabajar con los datos como si fuera un diccionario de Python
// print(datos['nombre'])


// per modificar dades desde python del jason darulo
// import json

// Abre el archivo JSON para escribir
// with open('datos.json', 'w') as f:
// Crea un diccionario con los nuevos datos
//   datos = {'nombre': 'Nuevo nombre'}
//   Escribe los datos al archivo JSON
//   json.dump(datos, f)